let myCity = [
        {
           "idp": "110000000000",
            "province": "北京市", 
            "name": "市辖区", 
            "id": "110100000000"
        }
    , 
 
        {
            "idp": "120000000000",
            "province": "天津市", 
            "name": "市辖区", 
            "id": "120100000000"
        }
    ,

        {
            "idp": "130000000000",
            "province": "河北省", 
            "name": "石家庄市", 
            "id": "130100000000"
        }, 

        {
            "idp": "130000000000",
            "province": "河北省", 
            "name": "唐山市", 
            "id": "130200000000"
        }, 
        {
            "idp": "130000000000",
            "province": "河北省", 
            "name": "秦皇岛市", 
            "id": "130300000000"
        }, 
        {
            "idp": "130000000000",
            "province": "河北省", 
            "name": "邯郸市", 
            "id": "130400000000"
        }, 
        {
            "idp": "130000000000",
            "province": "河北省", 
            "name": "邢台市", 
            "id": "130500000000"
        }, 
        {
            "province": "河北省", 
            "name": "保定市", 
            "id": "130600000000"
        },

        {
            "idp" :"140000000000",
            "province": "山西省", 
            "name": "太原市", 
            "id": "140100000000"
        }, 
        {
            "idp" :"140000000000",
            "province": "山西省", 
            "name": "大同市", 
            "id": "140200000000"
        }, 
        {
            "idp" :"140000000000",
            "province": "山西省", 
            "name": "阳泉市", 
            "id": "140300000000"
        }, 
        {
            "idp" :"140000000000",
            "province": "山西省", 
            "name": "长治市", 
            "id": "140400000000"
        }, 
        {
            "idp" :"140000000000",
            "province": "山西省", 
            "name": "晋城市", 
            "id": "140500000000"
        },
    ]

    